# DefaultSetback Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..DefaultSetback Property
WallSweepInfo Class See Also
---
The sweep setback distance from inserts, such as windows and doors.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double DefaultSetback { get; set; }
```

Visual Basic
---
```text
Public Property DefaultSetback As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double DefaultSetback {
	double get ();
	void set (double value);
}
```

# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace